In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.read_csv ("ds_salaries.csv")

In [4]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [5]:
df.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

In [6]:
df.isnull().sum()

Unnamed: 0            0
work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [7]:
df.head(2)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S

In [8]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [9]:
df.nunique()

Unnamed: 0            607
work_year               3
experience_level        4
employment_type         4
job_title              50
salary                272
salary_currency        17
salary_in_usd         369
employee_residence     57
remote_ratio            3
company_location       50
company_size            3
dtype: int64

In [35]:
jobtitle = df['job_title'].value_counts().head (10)
jobs = pd.DataFrame(jobtitle)
jobs.reset_index()

                    job_title  count
0              Data Scientist    143
1               Data Engineer    132
2                Data Analyst     97
3   Machine Learning Engineer     41
4          Research Scientist     16
5        Data Science Manager     12
6              Data Architect     11
7           Big Data Engineer      8
8  Machine Learning Scientist      8
9    Principal Data Scientist      7

### ¿Cual es el título que mas dinero gana de media?

In [18]:
df.groupby('job_title')['salary_in_usd'].mean().sort_values(ascending=False)

job_title
Data Analytics Lead                         405000.000000
Principal Data Engineer                     328333.333333
Financial Data Analyst                      275000.000000
Principal Data Scientist                    215242.428571
Director of Data Science                    195074.000000
Data Architect                              177873.909091
Applied Data Scientist                      175655.000000
Analytics Engineer                          175000.000000
Data Specialist                             165000.000000
Head of Data                                160162.600000
Machine Learning Scientist                  158412.500000
Data Science Manager                        158328.500000
Director of Data Engineering                156738.000000
Head of Data Science                        146718.750000
Applied Machine Learning Scientist          142068.750000
Lead Data Engineer                          139724.500000
Data Analytics Manager                      127134.285714
Cloud Data Engineer                         124647.000000
Data Engineering Manager                    123227.200000
Principal Data Analyst                      122500.000000
ML Engineer                                 117504.000000
Machine Learning Manager                    117104.000000
Lead Data Scientist                         115190.000000
Data Engineer                               112725.000000
Research Scientist                          109019.500000
Data Scientist                              108187.832168
Computer Vision Software Engineer           105248.666667
Staff Data Scientist                        105000.000000
Machine Learning Engineer                   104880.146341
Machine Learning Infrastructure Engineer    101145.000000
Big Data Architect                           99703.000000
Data Analyst                                 92893.061856
Lead Data Analyst                            92203.000000
Marketing Data Analyst                       88654.000000
Lead Machine Learning Engineer               87932.000000
Machine Learning Developer                   85860.666667
Head of Machine Learning                     79039.000000
Business Data Analyst                        76691.200000
Data Science Engineer                        75803.333333
BI Data Analyst                              74755.166667
Data Science Consultant                      69420.714286
AI Scientist                                 66135.571429
Data Analytics Engineer                      64799.250000
Finance Data Analyst                         61896.000000
ETL Developer                                54957.000000
Big Data Engineer                            51974.000000
Computer Vision Engineer                     44419.333333
NLP Engineer                                 37236.000000
Product Data Analyst                         13036.000000
3D Computer Vision Researcher                 5409.000000
Name: salary_in_usd, dtype: float64

¿Cuál es el salario más alto?

In [20]:
df.groupby('job_title')['salary_in_usd'].max().sort_values(ascending=False)

job_title
Principal Data Engineer                     600000
Financial Data Analyst                      450000
Research Scientist                          450000
Applied Machine Learning Scientist          423000
Principal Data Scientist                    416000
Data Scientist                              412000
Data Analytics Lead                         405000
Applied Data Scientist                      380000
Director of Data Science                    325000
Data Engineer                               324000
Lead Data Engineer                          276000
ML Engineer                                 270000
Data Architect                              266400
Machine Learning Scientist                  260000
Machine Learning Engineer                   250000
Data Science Manager                        241000
Head of Data                                235000
Head of Data Science                        224000
Analytics Engineer                          205300
Data Analyst                                200000
AI Scientist                                200000
Director of Data Engineering                200000
Machine Learning Infrastructure Engineer    195000
Lead Data Scientist                         190000
Data Engineering Manager                    174000
Principal Data Analyst                      170000
Lead Data Analyst                           170000
Data Specialist                             165000
Cloud Data Engineer                         160000
Data Analytics Manager                      150260
BI Data Analyst                             150000
Computer Vision Software Engineer           150000
Business Data Analyst                       135000
Data Science Engineer                       127221
Computer Vision Engineer                    125000
Machine Learning Manager                    117104
Big Data Engineer                           114047
Data Analytics Engineer                     110000
Staff Data Scientist                        105000
Data Science Consultant                     103000
Machine Learning Developer                  100000
Big Data Architect                           99703
Marketing Data Analyst                       88654
Lead Machine Learning Engineer               87932
Head of Machine Learning                     79039
Finance Data Analyst                         61896
ETL Developer                                54957
NLP Engineer                                 37236
Product Data Analyst                         20000
3D Computer Vision Researcher                 5409
Name: salary_in_usd, dtype: int64


Cual es la titulación mas demandada

In [34]:
df['job_title'].value_counts()

job_title
Data Scientist                              143
Data Engineer                               132
Data Analyst                                 97
Machine Learning Engineer                    41
Research Scientist                           16
Data Science Manager                         12
Data Architect                               11
Big Data Engineer                             8
Machine Learning Scientist                    8
Principal Data Scientist                      7
AI Scientist                                  7
Data Science Consultant                       7
Director of Data Science                      7
Data Analytics Manager                        7
ML Engineer                                   6
Computer Vision Engineer                      6
BI Data Analyst                               6
Lead Data Engineer                            6
Data Engineering Manager                      5
Business Data Analyst                         5
Head of Data                                  5
Applied Data Scientist                        5
Applied Machine Learning Scientist            4
Head of Data Science                          4
Analytics Engineer                            4
Data Analytics Engineer                       4
Machine Learning Developer                    3
Machine Learning Infrastructure Engineer      3
Lead Data Scientist                           3
Computer Vision Software Engineer             3
Lead Data Analyst                             3
Data Science Engineer                         3
Principal Data Engineer                       3
Principal Data Analyst                        2
ETL Developer                                 2
Product Data Analyst                          2
Director of Data Engineering                  2
Financial Data Analyst                        2
Cloud Data Engineer                           2
Lead Machine Learning Engineer                1
NLP Engineer                                  1
Head of Machine Learning                      1
3D Computer Vision Researcher                 1
Data Specialist                               1
Staff Data Scientist                          1
Big Data Architect                            1
Finance Data Analyst                          1
Marketing Data Analyst                        1
Machine Learning Manager                      1
Data Analytics Lead                           1
Name: count, dtype: int64

El salario medio de data engineer en 2022?

In [38]:
dataEngineer22 = df[(df['job_title'] == 'Data Engineer') & (df['work_year'] == 2022)]
avgsalary22DE = dataEngineer22['salary_in_usd'].mean()
avgsalary22DE

126375.69662921349


residencia con salario mas alto

cuántos con mínima/máxima experiencia trabajan en remoto